<?php
echo strtotime("2017/12/31 23:59:59");
echo "<br>";
echo date("Y年m月d日 H時i分s秒", 1514764799);
echo "<br>";

echo "＜ログ（意味、確認の仕方）＞";
echo "<br>";
echo "ログは履歴や情報の記録を取ることで、確認方はファイルの拡張子が.logのファイルがあり基本的にはその中に入っています。";
echo "<br>";
echo "＜クラウドサーバー、レンタルサーバー、VPSの違い＞";
echo "<br>";
echo "レンタルサーバは1つの物理サーバを複数のユーザで共用するもので、vpsは１つの仮想サーバ郡を個別で利用するもので、クラウドサーバは複数の仮想サーバを個別で利用するものです。";
echo "<br>";
echo "＜PHPのFWの種類と特徴＞";
echo "<br>";
echo "Codeigniter：一般的に必要とされるタスクを実行するための豊富なライブラリだけでなく、 ライブラリにアクセスするための単純なインターフェースと論理構造を提供することで、 1からコードを書くのに比べてプロジェクトの開発速度を加速させることができます";
echo "<br>";
echo "CakePHP：CakePHPはPHP用の高速開発フレームワークです。アプリケーションの開発、メンテナンス、インストールのための拡張性の高い仕組みがあります。";
echo "<br>";
echo "Laravel:今一番伸びており手軽さや扱いやすさから人気のフレームワークです。";
?>