<?php
$y = 10;
$x = 6;

echo $y + $x;
echo '<br>';
echo $y - $x;
echo '<br>';
echo $y * $x;
echo '<br>';
echo $y % $x;
echo '<br>';

$y += 5;
echo $y;
echo '<br>';

$y -= 5;
echo $y;
echo '<br>';

$y *= 5;
echo $y;
echo '<br>';

$y %= 5;
echo $y;
echo '<br>';

echo "＜エビデンス＞";
echo '<br>';
echo "証拠、根拠などの意味をもつ英単語、システム開発のテスト工程などで、システムが正しく動作している、あるいは不具合が生じたことを示す証拠となる書類やデータなどをこの様に呼ぶことが多い。";
echo '<br>';
echo "＜バッチ＞";
echo '<br>';
echo "バッチとは一束、一群、一団などの意味を持つ英単語でバッチ処理とは一定量のデータを集め一括処理をするための処理方法です。";
echo '<br>';
echo "＜MVCモデル＞";
echo '<br>';
echo "MVCとはモデル、ビュー、コントローラーの頭文字をとったものですでプログラムの中身整理術の一つ";
echo '<br>';
echo "モデル・システム内のビジネスロジックを担当します。システムの設計や機能をどうするかがここで行われる";
echo '<br>';
echo "ビュー・実際に表示したり、入力する機能を行うのがビューです";
echo '<br>';
echo "コントローラ・コントローラはユーザの入力に基づきモデルとビューを制御する役割をになっている。クライアント、モデル、ビューの橋渡し役になる。"

?>