<?php
define("ADMIN_EMAIL","y-i-group@gmail.com");
define("LIST_COUNT", 15);

echo ADMIN_EMAIL;
echo '<br>';
echo LIST_COUNT;
echo "<br>";
echo "<br>";

echo "＜デプロイ＞";
echo "<br>";
echo "作ったプログラムをしかるべき場所に置き直して使える状態にすること。";
echo "<br>";
echo "システム開発で開発したアプリケーションをサーバ上に展開、配置して利用できる様にすることです。";
echo "<br>";
echo "<br>";
echo "＜バリデーション＞";
echo "<br>";
echo "入力チェックのこと、入力内容や記述内容が要件を満たしているか、妥当性を確認すること";
echo "<br>";
echo "<br>";
echo "＜ウォーターフォール開発＞";
echo "<br>";
echo "プロジェクト完了日時が決定しており、さらに製品の最終仕様が開発の途中で変更されないなどの綿密な計画を立ててから開発するのがウォーターフォール型開発です";
echo "<br>";
echo "そのためしっかりと計画が立てられた長期のプロジェクトで使用されます。";
echo "<br>";
echo "＜アジャイル開発＞";
echo "<br>";
echo "システムやソフトウェア開発におけるプロジェクト開発手法の一つで大きな単位でシステムを区切ることなく、小単位で実装とテストを繰り返して開発を進めていく手法です";

?>